package com.vladhanin.myapplication

import com.vladhanin.myapplication.models.Income
import com.vladhanin.myapplication.models.Job
import com.vladhanin.myapplication.models.User

object Data {

    var CURRENT_USER: User? = null

    val USERS = setOf<User>(
        User(
            "firmeldir", "Йозеф", "Бевзенко", "156332142",
            listOf(
                Income("Преподаватель", "КПИ", "21.04.2020", "19434"),
                Income("Преподаватель", "КПИ", "21.03.2020", "19434"),
                Income("Преподаватель", "КПИ", "21.02.2020", "19434"),
                Income("Преподаватель", "КПИ", "21.01.2020", "24000"),
                Income("Преподаватель", "КПИ", "21.12.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.11.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.10.2019", "23000"),
                Income("Преподаватель", "КПИ", "21.9.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.8.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.7.2019", "21000"),
                Income("Преподаватель", "КПИ", "21.6.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.5.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.4.2019", "18000"),
                Income("Преподаватель", "КПИ", "21.3.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.2.2019", "19434"),
            ), mutableListOf(Job("Преподователь", "КПИ", "1960-2020")), false
        ),
        User(
            "subuday",
            "Артем",
            "Бандровський",
            "996042174",
            listOf(
                Income("Преподаватель", "КПИ", "21.04.2020", "19434"),
                Income("Программист", "Интел", "21.04.2020", "105000"),
                Income("Преподаватель", "КПИ", "21.03.2020", "19434"),
                Income("Программист", "Интел", "21.03.2020", "105000"),
                Income("Преподаватель", "КПИ", "21.02.2020", "19434"),
                Income("Программист", "Интел", "21.02.2020", "105000"),
                Income("Преподаватель", "КПИ", "21.01.2020", "23000"),
                Income("Программист", "Интел", "21.01.2020", "105000"),
                Income("Преподаватель", "КПИ", "21.12.2019", "19434"),
                Income("Программист", "Интел", "21.12.2019", "105000"),
                Income("Преподаватель", "КПИ", "21.11.2019", "19434"),
                Income("Программист", "Интел", "21.11.2019", "105000"),
            ),
            mutableListOf(
                Job("Программист", "Интел", "1958-2010"),
                Job("Преподователь", "КПИ", "1960-2020")
            ),
            false
        ),
        User(
            "firmeldir1", "Атанас", "Балтача", "298475188",
            listOf(

            ), mutableListOf(), false
        ),
        User(
            "admin", "Лідія", "Архипчук", "276976705",
            listOf(

            ), mutableListOf(), true
        )
    )
}