package com.vladhanin.myapplication

import com.vladhanin.myapplication.models.Income
import com.vladhanin.myapplication.models.Job
import com.vladhanin.myapplication.models.Pension
import com.vladhanin.myapplication.models.User
import java.time.Instant
import java.util.*

object Data {

    var CURRENT_USER: User? = null

    val USERS = setOf(
        User(
            "1a",
            "Йозеф",
            "Бевзенко",
            "156332142",
            Date(999999000),
            "вулиця Трояндова, 12, Чернівці, Чернівецька область, 58000",
            "вулиця Головна, 16, Чернівці, Чернівецька область, 58000",
            listOf(
                Income("Преподаватель", "КПИ", "21.04.2020", "19434"),
                Income("Преподаватель", "КПИ", "21.03.2020", "19434"),
                Income("Преподаватель", "КПИ", "21.02.2020", "19434"),
                Income("Преподаватель", "КПИ", "21.01.2020", "24000"),
                Income("Преподаватель", "КПИ", "21.12.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.11.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.10.2019", "23000"),
                Income("Преподаватель", "КПИ", "21.9.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.8.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.7.2019", "21000"),
                Income("Преподаватель", "КПИ", "21.6.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.5.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.4.2019", "18000"),
                Income("Преподаватель", "КПИ", "21.3.2019", "19434"),
                Income("Преподаватель", "КПИ", "21.2.2019", "19434"),
            ),
            mutableListOf(Job("Преподователь", "КПИ", "1960-2020")),
            null,
            false
        ),
        User(
            "6b101aaa111000220011",
            "Артем",
            "Бандровський",
            "996042174",
            Date(889919000),
            "вулиця Качалова, 3А, Дніпро, Дніпропетровська область, 49000",
            "вулиця Тиверська, 1, Дніпро, Дніпропетровська область, 49000",
            listOf(
                Income("Преподаватель", "КПИ", "21.04.2020", "19434"),
                Income("Программист", "Интел", "21.04.2020", "105000"),
                Income("Преподаватель", "КПИ", "21.03.2020", "19434"),
                Income("Программист", "Интел", "21.03.2020", "105000"),
                Income("Преподаватель", "КПИ", "21.02.2020", "19434"),
                Income("Программист", "Интел", "21.02.2020", "105000"),
                Income("Преподаватель", "КПИ", "21.01.2020", "23000"),
                Income("Программист", "Интел", "21.01.2020", "105000"),
                Income("Преподаватель", "КПИ", "21.12.2019", "19434"),
                Income("Программист", "Интел", "21.12.2019", "105000"),
                Income("Преподаватель", "КПИ", "21.11.2019", "19434"),
                Income("Программист", "Интел", "21.11.2019", "105000"),
            ),
            mutableListOf(
                Job("Программист", "Интел", "1958-2010"),
                Job("Преподователь", "КПИ", "1960-2020")
            ),
            Pension(
                "Чорнобилець",
                "Головне управління Пенсійного фонду України у Волинській області",
                "22.02.2002"
            ),
            false
        ),
        User(
            "5b221cca111000220011",
            "Атанас",
            "Балтача",
            "298475188",
            Date(),
            "",
            "",
            listOf(

            ),
            mutableListOf(),
            null,
            false
        ),
        User(
            "gh221cca122200220011",
            "Лідія",
            "Архипчук",
            "276976705",
            Date(779919000),
            "Пилипівський провулок, 5А, Київ, 02000",
            "вулиця Василя Дончука, 7, Київ, 02000",
            listOf(

            ),
            mutableListOf(),
            null,
            true
        )
    )

    val TEST_USER: User = USERS.toList()[0]
}